app/controllers/anecdotes_controller.rb

SELECT "anecdotes".* FROM "anecdotes"
---
  def index
    @anecdotes = Anecdote.all

INSERT INTO "anecdotes" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('ruby on rails', 'on sait pas dev mais là on est en ligne', 1, '2025-02-21 11:50:21.152739', '2025-02-21 11:50:21.152739') RETURNING "id"
---
  def create
    @anecdote = Anecdote.new(anecdote_params)

    respond_to do |format|
      if @anecdote.save

SELECT "anecdotes".* FROM "anecdotes" WHERE "anecdotes"."id" = 1 LIMIT 1
---
    def set_anecdote
      @anecdote = Anecdote.find(params.expect(:id))